src/test/java/es/codeurjc/web/nitflex/artillery/load-test.yml
config:
  target: "http://localhost:8080"  
  environments:
    local:
      phases:
        - duration: 40
          arrivalRate: 5  # 5 usuarios por segundo
      ensure:
        p95: 100  # 95% de las respuestas deben estar por debajo de 100ms
        maxErrorRate: 0  # No se permite ningún fallo
    staging:
      phases:
        - duration: 40
          arrivalRate: 10  # Warm-up: comienza con 10 usuarios/s...
          rampTo: 50       # ...y sube hasta 50 usuarios/s
        - pause: 30        # Pausa de 30 segundos
        - duration: 300
          arrivalRate: 50  # Load test: 50 usuarios por segundo
          maxVusers: 8     # Máximo de 8 usuarios simultáneos
      ensure:
        p95: 300  # 95% de las respuestas deben estar por debajo de 300ms
        maxErrorRate: 0  # No se permite ningún fallo

scenarios:
  - name: "Escenario 1 - Consultar películas"  # 70%
    weight: 70
    flow:
      - get:
          url: "/api/films/"
          capture:
            - json: "$[0].id"
              as: "filmId"
      - get:
          url: "/api/films/{{filmId}}"

  - name: "Escenario 2 - Crear y comprobar película"  # 20%
    weight: 20
    flow:
      - post:
          url: "/api/films/"
          json:
            title: "Nueva película {{ $randomString() }}"
            synopsis: "Sinopsis de prueba"
            releaseYear: "2025"
            ageRating: "+13"
          capture:
            - json: "$.id"
              as: "newFilmId"
      - get:
          url: "/api/films/{{newFilmId}}"

  - name: "Escenario 3 - Crear, comprobar y borrar película"  # 10%
    weight: 10
    flow:
      - post:
          url: "/api/films/"
          json:
            title: "Película temporal {{ $randomString() }}"
            synopsis: "Sinopsis temporal"
            releaseYear: "2025"
            ageRating: "+13"
          capture:
            - json: "$.id"
              as: "tempFilmId"
      - get:
          url: "/api/films/{{tempFilmId}}"
      - delete:
          url: "/api/films/{{tempFilmId}}"
      - get:
          url: "/api/films/{{tempFilmId}}"
          expect:
            - statusCode: 404  # La película ya no debería existir